{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/real-time-mod",
  "1.21.1": {
    "2.0.0": "- Added Forecast and Fortitude overlays. \n- Added Forecast and Fortitude overlay key binds \n- Added Real Time, Weather, Temperature, Moon Phase, Hemisphere, and Regional Difficulty mechanics. \n- Added time based advancements. \n- Added game rules to customize the experience. \n- Added fortitude attributes. \n- Added potion, enchantment, and armor type attribute modifiers. \n- Added Cooler, Heater and Thermostat blocks. \n- Added Fortitude potions and enchantments. \n- Added Temperature damage type. \n- Added Format and Real Time Mod commands. \n- Added Real Time Mod creative tab. \n- Added Serene Seasons support. \n- Added potion effects and particles. \n- Updated the official wiki. \n- Fixed several issues."
  },
  "1.20.4": {
    "1.0.0": "ADDED:\n- Added the RTM TIME GET public command to get the time of day.\n\n-Added the RTMA RUN TIME script command which requires op permission level 2.\n\n -Added script to convert computer time to game time.\n\n -Added function to run the RTMA RUN TIME command.\n\n -Added the mod-settings.json to control the game settings file location.\n\n -Added the game-settings.json to control settings for the mod.\n\n -Added support to have per-world game settings and support for the server and single-player folder directories.\n\n -Added setting in the game-settings.json to disable the override for the doDaylightCycle setting.\n\n -Added script to get the values from the config files.",
    "1.1.0": "ADDED:\n-Added the weather.json that controls default weather and adds support for mods that add custom weather via commands.\n\n -Added weather forecast generation for the next 7 days.\n\n -Added global map variables to keep track of the last played date for the date checker script.\n\n -Added date checker function which is run through the Minecraft function tick tag.\n\n -Added a new command to run the script for the date checker under /rtma run dateChecker.\n\n -Added more command messages to support the new commands added.\n\n -Added support to disable time being set to real-time in the game-settings.json file.\n\n -Added support for weather generation after the weather has been moved towards 'day1'.\n\n -Added support to the weather.json to have custom weather names and weather name prefixes. Eg Heavy Rain or Moderate Rain etc.\n\n -Added the date checker script which keeps track of the last time day/month/year the game was played and runs script dependent on dates.\n\n -Added support for the weather to change based on the date changing, new weather will be moved forward to 'day1' in the weather.json file.\n\n -Added support to check the last played date for debugging purposes. This can be run using the new /rtma get lastDate command.\n\n -Added GUI for seven-day forecast and per day weather page with additional information.\n\n -Added weather icons for Minecraft clear, rain, and thunder weather.\n\n -Added moon icons for moon phases which will be coming in a future version.\n\n -Added a new command for '/rtm weather' which opens the seven-day forecast GUI.\n\n -Added weather.json value called icon in both the weather object and day# objects to allow support for GUI icon detection.\n\n CHANGES:\n -The game_settings.json file now supports do_weather_cycle to change the doWeatherCycle game rule.\n\n -The game_settings.json file will automatically update for older versions of the file when a world is loaded.\n\n -The game_settings.json file now supports do_real_time and do_forecast which enables or disables weather and real-time mechanics.\n\n NOTES:\n -Custom weather icons can be requested but will require me to manually make and add them to the UI. "
  },
  "promos": {
    "1.21.1-latest": "2.0.0",
    "1.21.1-recommended": "2.0.0",
    "1.20.4-latest": "1.1.0",
    "1.20.4-recommended": "1.1.0"
  }
}
